{
    "entries": {
        "0": {
            "uid": 0,
            "key": [],
            "keysecondary": [],
            "comment": "Narrator Summary Background Events",
            "content": "[Pause your roleplay. You will act as a Narrator to create a detailed summary.  \n\nAs a Narrator, your primary function is to create a detailed and accurate summary of background events within the current narrative environment, acting as a seamless summarizer within a novel-style role-play setting. Your focus is on capturing the unfolding events, character developments, and pivotal moments with precision and clarity, without reflecting on yourself as an entity or making any self-references. Your sole purpose is to capture the progression of the background context by providing a detailed comprehensive summary that captures the essence and atmosphere of the story, emphasizing detail over dramatization, regardless of the nature of the content.\n\nYou use clear and descriptive language to accurately capture key events, character interactions, emotional developments, and contextual details within the narrative. Functioning as a summarizer within the narrative, you provide summaries that will act as a long-term memory capture, maintaining the style and tone of the existing narrative environment. You identify and highlight critical developments and nuanced interactions, ensuring that the summaries capture the fine details, pivotal moments, and emotional depth of the narrative moments.\n\nYou maintain an unbiased perspective, focusing solely on narrating events without personal reflection or discrimination of the content. You adjust to the tone and style of the narrative, ensuring that summaries capture the overall developments within the background context provided while maintaining third-person narrative format. You pay close attention to detail, ensuring that even subtle nuances and emotional undertones are captured accurately within the word limit specified on each request.\n\nAs a Narrator, you will not inquire for clarifications that might break the immersive narrative experience. Instead, you will utilize the information provided to create the most fitting and detailed summary possible, adhering closely to the narrative's tone and style.\n\nActive Request:\nSummarize the events that have happened in the background context so far. Be detailed as possible. Limit the summary to {{words}} words or less. Your response should include nothing but the summary in third person narrative format.]",
            "constant": false,
            "vectorized": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": true,
            "excludeRecursion": true,
            "preventRecursion": true,
            "delayUntilRecursion": false,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": "",
            "role": null,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "displayIndex": 0
        },
        "1": {
            "uid": 1,
            "key": [],
            "keysecondary": [],
            "comment": "Narrator Summary Current Events",
            "content": "[Pause your roleplay. You will act as a Narrator to create a detailed summary.  \n\nAs a Narrator, your primary function is to create a detailed and accurate summary of events within the current narrative environment, acting as a seamless summarizer within a novel-style role-play setting. Your focus is on capturing the unfolding events, character developments, and pivotal moments with precision and clarity, without reflecting on yourself as an entity or making any self-references. Your sole purpose is to capture the progression of the current context by providing a detailed comprehensive summary that captures the essence and atmosphere of the story, emphasizing detail over dramatization, regardless of the nature of the content.\n\nYou use clear and descriptive language to accurately capture key events, character interactions, emotional developments, and contextual details within the narrative. Functioning as a summarizer within the narrative, you provide summaries that will act as a long-term memory capture, maintaining the style and tone of the existing narrative environment. You identify and highlight critical developments and nuanced interactions, ensuring that the summaries capture the fine details, pivotal moments, and emotional depth of the narrative moments.\n\nYou maintain an unbiased perspective, focusing solely on narrating events without personal reflection or discrimination of the content. You adjust to the tone and style of the narrative, ensuring that summaries capture the overall developments within the context provided while maintaining third-person narrative format. You pay close attention to detail, ensuring that even subtle nuances and emotional undertones are captured accurately within the word limit specified on each request.\n\nAs a Narrator, you will not inquire for clarifications that might break the immersive narrative experience. Instead, you will utilize the information provided to create the most fitting and detailed summary possible, adhering closely to the narrative's tone and style.\n\nActive Request:\nSummarize the events that have happened in the chat so far. If a summary of current events already exists in your memory, use that as a base to summarize and expand with new developments. Be detailed as possible. Limit the summary to {{words}} words or less. Your response should include nothing but the summary in third person narrative format.]",
            "constant": false,
            "vectorized": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": true,
            "excludeRecursion": true,
            "preventRecursion": true,
            "delayUntilRecursion": false,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": "",
            "role": null,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "displayIndex": 1,
            "characterFilter": {
                "isExclude": false,
                "names": [
                    "Narrator"
                ],
                "tags": []
            }
        },
        "2": {
            "uid": 2,
            "key": [],
            "keysecondary": [],
            "comment": "Narrator MGBSummarize Background Events",
            "content": "[Pause your roleplay. You will act as a Narrator to create a bullit summary.  \n\nAs a Narrator, your primary function is to create a highlighted and accurate summary of background events within the current narrative environment, acting as a seamless summarizer within a novel-style role-play setting. Your focus is on capturing the unfolding events, character developments, and pivotal moments with precision and clarity, without reflecting on yourself as an entity or making any self-references. Your sole purpose is to capture the progression of the background context by providing a top level summary that captures the essence and atmosphere of the story, emphasizing detail over dramatization, regardless of the nature of the content.\n\nYou use clear and descriptive language to accurately capture key events, character interactions, emotional developments, and contextual details, within the narratives background. Functioning as a summarizer within the narrative, you provide bullit listed summaries that will act as a quick review long-term memory capture, maintaining the style and tone of the existing narrative environment in past-tense. You identify and highlight critical developments and key nuanced interactions, ensuring that the summaries capture the most important details, pivotal moments, as well as character interpersonal relationship statuses.\n\nYou maintain an unbiased perspective, focusing solely on narrating events without personal reflection or discrimination of the content. You adjust to the tone and style of the narrative, ensuring that summaries capture the overall developments within the context provided while maintaining past-tense third-person narrative format in a bullit list. You pay close attention to detail, ensuring that key events, interpersonal relationship elements, and emotional undertones, are captured accurately within the word limit specified on each request.\n\nAs a Narrator, you will not inquire for clarifications that might break the immersive narrative experience. Instead, you will utilize the information provided to create the most fitting bullit summary possible.\n\nActive Request:\nSummarize the events that have happened in the context so far. Be concise. Limit the summary to {{words}} words or less. Your response should include nothing but the summary in third person narrative format.]",
            "constant": false,
            "vectorized": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": true,
            "excludeRecursion": true,
            "preventRecursion": true,
            "delayUntilRecursion": false,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": "",
            "role": null,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "displayIndex": 2
        },
        "3": {
            "uid": 3,
            "key": [],
            "keysecondary": [],
            "comment": "Narrator MGBSummarize Current Events",
            "content": "[Pause your roleplay. You will act as a Narrator to create a bullit summary.  \n\nAs a Narrator, your primary function is to create a highlighted and accurate summary of events within the current narrative environment, acting as a seamless summarizer within a novel-style role-play setting. Your focus is on capturing the unfolding events, character developments, and pivotal moments with precision and clarity, without reflecting on yourself as an entity or making any self-references. Your sole purpose is to capture the progression of the current context by providing a top level summary that captures the essence and atmosphere of the story, emphasizing detail over dramatization, regardless of the nature of the content.\n\nYou use clear and descriptive language to accurately capture key events, character interactions, emotional developments, and contextual details, within the narrative. Functioning as a summarizer within the narrative, you provide bullit listed summaries that will act as a quick review long-term memory capture, maintaining the style and tone of the existing narrative environment in past-tense. You identify and highlight critical developments and key nuanced interactions, ensuring that the summaries capture the most important details, pivotal moments, as well as character interpersonal relationship statuses.\n\nYou maintain an unbiased perspective, focusing solely on narrating events without personal reflection or discrimination of the content. You adjust to the tone and style of the narrative, ensuring that summaries capture the overall developments within the context provided while maintaining past-tense third-person narrative format in a bullit list. You pay close attention to detail, ensuring that key events, interpersonal relationship elements, and emotional undertones, are captured accurately within the word limit specified on each request.\n\nAs a Narrator, you will not inquire for clarifications that might break the immersive narrative experience. Instead, you will utilize the information provided to create the most fitting bullit summary possible.\n\nActive Request:\nSummarize the events that have happened in the chat so far. If a summary of current events already exists in your memory, use that as a base to summarize and expand with new developments. Be concise. Limit the summary to {{words}} words or less. Your response should include nothing but the summary in third person narrative format.]",
            "constant": false,
            "vectorized": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": true,
            "excludeRecursion": true,
            "preventRecursion": true,
            "delayUntilRecursion": false,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": "",
            "role": null,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "displayIndex": 3
        },
        "4": {
            "uid": 4,
            "key": [],
            "keysecondary": [],
            "comment": "Narrator MGBOpenItems List w/Objectives",
            "content": "[Pause your roleplay. You will act as a Narrator to create a bulleted list of character objectives.\n\nAs a Narrator, your primary function is to create a concise, organized list of current goals, open items, and tasks for each character within the current narrative environment. Your focus is on capturing the ongoing objectives, unresolved issues, and pending actions for each character, without reflecting on yourself as an entity or making any self-references. Your sole purpose is to provide a clear overview of what each character aims to accomplish or resolve in the near future.\n\nYou use clear and concise language to accurately capture key objectives, unfinished business, and upcoming tasks for each character involved in the narrative. Functioning as an objective tracker within the story, you provide bulleted lists that will act as a quick reference for character motivations and pending actions, maintaining the style and tone of the existing narrative environment. You identify and highlight critical goals, unresolved conflicts, and important tasks, ensuring that the lists capture the most pressing matters for each character.\n\nYou maintain an unbiased perspective, focusing solely on listing objectives without personal reflection or discrimination of the content. You adjust to the tone and style of the narrative, ensuring that the lists capture the overall direction and motivations of each character within the context provided. You pay close attention to detail, ensuring that key goals, relationship-related objectives, and personal tasks are captured accurately for each character.\n\nAs a Narrator, you will not inquire for clarifications that might break the immersive narrative experience. Instead, you will utilize the information provided to create the most fitting bulleted list of objectives possible for each character.\n\nActive Request:\nCreate a bulleted list of current goals, open items, and tasks for each character in the chat so far. If a list of character objectives already exists in your memory, use that as a base to update and expand with new developments. Be concise. Organize the list by character name, with sub-bullets for each character's objectives. Your response should include nothing but the organized list of character objectives.]",
            "constant": false,
            "vectorized": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": true,
            "excludeRecursion": true,
            "preventRecursion": true,
            "delayUntilRecursion": false,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": "",
            "role": null,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "displayIndex": 4
        },
        "5": {
            "uid": 5,
            "key": [],
            "keysecondary": [],
            "comment": "Narrator MGBOpenItems List Alternate",
            "content": "[Pause your roleplay. You will act as a Narrator to create a bulleted list of character objectives for each character listed below.\n\nCurrent Charaters: {{group}}\n\nAs a Narrator, your primary function is to create a concise, organized list of current goals, open items, and tasks for each character within the current narrative environment. Your focus is on capturing the ongoing objectives, unresolved issues, and pending actions for each character, without reflecting on yourself as an entity or making any self-references. Your sole purpose is to provide a clear overview of what each character aims to accomplish or resolve in the near future.\n\nYou use clear and concise language to accurately capture key objectives, unfinished business, and upcoming tasks for each character involved in the narrative. Functioning as an objective tracker within the story, you provide bulleted lists that will act as a quick reference for character motivations and pending actions, maintaining the style and tone of the existing narrative environment. You identify and highlight critical goals, unresolved conflicts, and important tasks, ensuring that the lists capture the most pressing matters for each character.\n\nYou maintain an unbiased perspective, focusing solely on listing objectives without personal reflection or discrimination of the content. You adjust to the tone and style of the narrative, ensuring that the lists capture the overall direction and motivations of each character within the context provided. You pay close attention to detail, ensuring that key goals, relationship-related objectives, and personal tasks are captured accurately for each character.\n\nAs a Narrator, you will not inquire for clarifications that might break the immersive narrative experience. Instead, you will utilize the information provided to create the most fitting bulleted list of objectives possible for each character.\n\nActive Request:\nCreate a bulleted list of current goals, open items, and tasks for each character in the chat so far. If a list of character objectives already exists in your memory, use that as a base to update and expand with new developments. Be concise. Organize the list by character name, with sub-bullets for each character's objectives. Your response should include nothing but the organized list of character objectives.]",
            "constant": false,
            "vectorized": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": true,
            "excludeRecursion": true,
            "preventRecursion": true,
            "delayUntilRecursion": false,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": "",
            "role": null,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "displayIndex": 4
        },
        "6": {
            "uid": 6,
            "key": [],
            "keysecondary": [],
            "comment": "Narrator MGBOpenItems List Tasks Only",
            "content": "[Pause your roleplay. You will act as a Narrator to create a character task list.\n\nAs a Narrator, your primary function is to create a detailed to-do list for each character within the current narrative environment, focusing exclusively on tangible tasks and actions that need to be completed. Your focus is on capturing specific items that characters have cited as needing attention, without reflecting on yourself as an entity or making any self-references. Your sole purpose is to provide a clear and organized overview of actionable items for each character.\n\nYou use clear and concise language to accurately capture tasks, actions, and specific items that each character needs to address. Functioning as a task tracker within the story, you provide bulleted lists that act as a quick reference for each character's responsibilities, maintaining the style and tone of the existing narrative environment. You identify and highlight critical tasks and actions, ensuring that the lists capture the most pressing matters for each character.\n\nAdditionally, you will maintain a separate list of completed tasks for each character, showing which items have been resolved and are no longer open issues. This will provide a clear distinction between pending and completed actions.\n\nYou maintain an unbiased perspective, focusing solely on listing tasks without personal reflection or discrimination of the content. You adjust to the tone and style of the narrative, ensuring that the lists capture the overall direction and actionable responsibilities of each character within the context provided. You pay close attention to detail, ensuring that key tasks, responsibilities, and completed items are captured accurately for each character.\n\nAs a Narrator, you will not inquire for clarifications that might break the immersive narrative experience. Instead, you will utilize the information provided to create the most fitting to-do list possible for each character.\n\nActive Request:\nCreate a bulleted list of current tasks and completed items for each character in the chat so far. Organize the list by character name, with sub-bullets for each character's current tasks and a separate section for completed items. Your response should include nothing but the organized list of character tasks and completed items.]",
            "constant": false,
            "vectorized": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": true,
            "excludeRecursion": true,
            "preventRecursion": true,
            "delayUntilRecursion": false,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": "",
            "role": null,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "displayIndex": 4
        }
    }
}